weber-lin-nthu/Sysmaker_QEMU/include/hw/misc/stm32f429_rcc_internals.h
/*
 * STM32F429 RCC (Reset and clock control)
 *
 * Copyright (c) 2023 Arnaud Minier <arnaud.minier@telecom-paris.fr>
 * Copyright (c) 2023 Inès Varhol <ines.varhol@telecom-paris.fr>
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * This work is licensed under the terms of the GNU GPL, version 2 or later.
 * See the COPYING file in the top-level directory.
 *
 * The reference used is the STMicroElectronics RM0351 Reference manual
 * for STM32F429 and STM32L4x6 advanced Arm ® -based 32-bit MCUs.
 *
 * Inspired by the BCM2835 CPRMAN clock manager implementation by Luc Michel.
 */

#ifndef HW_STM32F429_RCC_INTERNALS_H
#define HW_STM32F429_RCC_INTERNALS_H

#include "hw/registerfields.h"
#include "hw/misc/stm32f429_rcc.h"

#define TYPE_RCC_CLOCK_MUX "stm32f429-rcc-clock-mux"
#define TYPE_RCC_PLL       "stm32f429-rcc-pll"

OBJECT_DECLARE_SIMPLE_TYPE(RccClockMuxState, RCC_CLOCK_MUX)
OBJECT_DECLARE_SIMPLE_TYPE(RccPllState, RCC_PLL)

/* Register map */
REG32(CR, 0x00)
FIELD(CR, PLLSAIRDY, 29, 1)
FIELD(CR, PLLSAION, 28, 1)
FIELD(CR, PLLI2SRDY, 27, 1)
FIELD(CR, PLLI2SON, 26, 1)
FIELD(CR, PLLRDY, 25, 1)
FIELD(CR, PLLON, 24, 1)
FIELD(CR, CSSON, 19, 1)
FIELD(CR, HSEBYP, 18, 1)
FIELD(CR, HSERDY, 17, 1)
FIELD(CR, HSEON, 16, 1)
FIELD(CR, HSICAL, 8, 8)
FIELD(CR, HSITRIM, 3, 4)
FIELD(CR, HSIRDY, 1, 1)
FIELD(CR, HSION, 0, 1)
REG32(PLLCFGR, 0x04)
FIELD(PLLCFGR, PLLQ, 24, 4)
FIELD(PLLCFGR, PLLSRC, 22, 1)
FIELD(PLLCFGR, PLLP, 16, 2)
FIELD(PLLCFGR, PLLN, 6, 9)
FIELD(PLLCFGR, PLLM, 0, 6)
REG32(CFGR, 0x08)
FIELD(CFGR, MCO2, 30, 2)
FIELD(CFGR, MCO2PRE, 27, 3)
FIELD(CFGR, MCO1PRE, 24, 3)
FIELD(CFGR, I2SSCR, 23, 1)
FIELD(CFGR, MCO1, 21, 2)
FIELD(CFGR, RTCPRE, 16, 5)
FIELD(CFGR, PPRE2, 13, 3)
FIELD(CFGR, PPRE1, 10, 3)
FIELD(CFGR, HPRE, 4, 4)
FIELD(CFGR, SWS, 2, 2)
FIELD(CFGR, SW, 0, 2)
REG32(CIR, 0x0C)
FIELD(CIR, CSSC, 23, 1)
FIELD(CIR, PLLSAIRDYC, 22, 1)
FIELD(CIR, PLLI2SRDYC, 21, 1)
FIELD(CIR, PLLRDYC, 20, 1)
FIELD(CIR, HSERDYC, 19, 1)
FIELD(CIR, HSIRDYC, 18, 1)
FIELD(CIR, LSERDYC, 17, 1)
FIELD(CIR, LSIRDYC, 16, 1)
FIELD(CIR, PLLSAIRDYIE, 14, 1)
FIELD(CIR, PLLI2SRDYIE, 13, 1)
FIELD(CIR, PLLRDYIE, 12, 1)
FIELD(CIR, HSERDYIE, 11, 1)
FIELD(CIR, HSIRDYIE, 10, 1)
FIELD(CIR, LSERDYIE, 9, 1)
FIELD(CIR, LSIRDYIE, 8, 1)
FIELD(CIR, CSSF, 7, 1)
FIELD(CIR, PLLSAIRDYF, 6, 1)
FIELD(CIR, PLLI2SRDYF, 5, 1)
FIELD(CIR, PLLRDYF, 4, 1)
FIELD(CIR, HSERDYF, 3, 1)
FIELD(CIR, HSIRDYF, 2, 1)
FIELD(CIR, LSERDYF, 1, 1)
FIELD(CIR, LSIRDYF, 0, 1)
REG32(PLLI2SCFGR, 0x84)
FIELD(PLLI2SCFGR, PLLI2SR, 28, 3)
FIELD(PLLI2SCFGR, PLLI2SQ, 24, 4)
FIELD(PLLI2SCFGR, PLLI2SN, 6, 9)
REG32(PLLSAICFGR, 0x88)
FIELD(PLLSAICFGR, PLLSAIR, 28, 3)
FIELD(PLLSAICFGR, PLLSAIQ, 24, 4)
FIELD(PLLSAICFGR, PLLSAIN, 6, 9)
// REG32(CIER, 0x18) // TODO: below are not yet updated
// /* HSI48RDYIE: only on STM32L496xx/4A6xx devices */
// FIELD(CIER, LSECSSIE, 9, 1)
// FIELD(CIER, PLLSAI2RDYIE, 7, 1)
// FIELD(CIER, PLLSAIRDYIE, 6, 1)
// FIELD(CIER, PLLRDYIE, 5, 1)
// FIELD(CIER, HSERDYIE, 4, 1)
// FIELD(CIER, HSIRDYIE, 3, 1)
// FIELD(CIER, MSIRDYIE, 2, 1)
// FIELD(CIER, LSERDYIE, 1, 1)
// FIELD(CIER, LSIRDYIE, 0, 1)
// REG32(CIFR, 0x1C)
// /* HSI48RDYF: only on STM32L496xx/4A6xx devices */
// FIELD(CIFR, LSECSSF, 9, 1)
// FIELD(CIFR, CSSF, 8, 1)
// FIELD(CIFR, PLLSAI2RDYF, 7, 1)
// FIELD(CIFR, PLLSAIRDYF, 6, 1)
// FIELD(CIFR, PLLRDYF, 5, 1)
// FIELD(CIFR, HSERDYF, 4, 1)
// FIELD(CIFR, HSIRDYF, 3, 1)
// FIELD(CIFR, MSIRDYF, 2, 1)
// FIELD(CIFR, LSERDYF, 1, 1)
// FIELD(CIFR, LSIRDYF, 0, 1)
// REG32(CICR, 0x20)
// /* HSI48RDYC: only on STM32L496xx/4A6xx devices */
// FIELD(CICR, LSECSSC, 9, 1)
// FIELD(CICR, CSSC, 8, 1)
// FIELD(CICR, PLLSAI2RDYC, 7, 1)
// FIELD(CICR, PLLSAIRDYC, 6, 1)
// FIELD(CICR, PLLRDYC, 5, 1)
// FIELD(CICR, HSERDYC, 4, 1)
// FIELD(CICR, HSIRDYC, 3, 1)
// FIELD(CICR, MSIRDYC, 2, 1)
// FIELD(CICR, LSERDYC, 1, 1)
// FIELD(CICR, LSIRDYC, 0, 1)
// REG32(AHB1RSTR, 0x28)
// REG32(AHB2RSTR, 0x2C)
// REG32(AHB3RSTR, 0x30)
// REG32(APB1RSTR1, 0x38)
// REG32(APB1RSTR2, 0x3C)
// REG32(APB2RSTR, 0x40)
// REG32(AHB1ENR, 0x48)
// /* DMA2DEN: reserved for STM32L475xx */
// FIELD(AHB1ENR, TSCEN, 16, 1)
// FIELD(AHB1ENR, CRCEN, 12, 1)
// FIELD(AHB1ENR, FLASHEN, 8, 1)
// FIELD(AHB1ENR, DMA2EN, 1, 1)
// FIELD(AHB1ENR, DMA1EN, 0, 1)
// REG32(AHB2ENR, 0x4C)
// FIELD(AHB2ENR, RNGEN, 18, 1)
// /* HASHEN: reserved for STM32L475xx */
// FIELD(AHB2ENR, AESEN, 16, 1)
// /* DCMIEN: reserved for STM32L475xx */
// FIELD(AHB2ENR, ADCEN, 13, 1)
// FIELD(AHB2ENR, OTGFSEN, 12, 1)
// /* GPIOIEN: reserved for STM32L475xx */
// FIELD(AHB2ENR, GPIOHEN, 7, 1)
// FIELD(AHB2ENR, GPIOGEN, 6, 1)
// FIELD(AHB2ENR, GPIOFEN, 5, 1)
// FIELD(AHB2ENR, GPIOEEN, 4, 1)
// FIELD(AHB2ENR, GPIODEN, 3, 1)
// FIELD(AHB2ENR, GPIOCEN, 2, 1)
// FIELD(AHB2ENR, GPIOBEN, 1, 1)
// FIELD(AHB2ENR, GPIOAEN, 0, 1)
// REG32(AHB3ENR, 0x50)
// FIELD(AHB3ENR, QSPIEN, 8, 1)
// FIELD(AHB3ENR, FMCEN, 0, 1)
REG32(APB1ENR1, 0x40)
FIELD(APB1ENR1, UART8EN, 31, 1)
FIELD(APB1ENR1, UART7EN, 30, 1)
FIELD(APB1ENR1, DACEN, 29, 1)
FIELD(APB1ENR1, PWREN, 28, 1)
FIELD(APB1ENR1, CAN2EN, 26, 1)
FIELD(APB1ENR1, CAN1EN, 25, 1)
/* CRSEN: reserved for STM32L475xx */
FIELD(APB1ENR1, I2C3EN, 23, 1)
FIELD(APB1ENR1, I2C2EN, 22, 1)
FIELD(APB1ENR1, I2C1EN, 21, 1)
FIELD(APB1ENR1, UART5EN, 20, 1)
FIELD(APB1ENR1, UART4EN, 19, 1)
FIELD(APB1ENR1, USART3EN, 18, 1)
FIELD(APB1ENR1, USART2EN, 17, 1)
FIELD(APB1ENR1, SPI3EN, 15, 1)
FIELD(APB1ENR1, SPI2EN, 14, 1)
FIELD(APB1ENR1, WWDGEN, 11, 1)
/* RTCAPBEN: reserved for STM32L475xx */
FIELD(APB1ENR1, TIM14EN, 8, 1)
FIELD(APB1ENR1, TIM13EN, 7, 1)
FIELD(APB1ENR1, TIM12EN, 6, 1)
FIELD(APB1ENR1, TIM7EN, 5, 1)
FIELD(APB1ENR1, TIM6EN, 4, 1)
FIELD(APB1ENR1, TIM5EN, 3, 1)
FIELD(APB1ENR1, TIM4EN, 2, 1)
FIELD(APB1ENR1, TIM3EN, 1, 1)
FIELD(APB1ENR1, TIM2EN, 0, 1)
// REG32(APB1ENR2, 0x5C)
// FIELD(APB1ENR2, LPTIM2EN, 5, 1)
// FIELD(APB1ENR2, SWPMI1EN, 2, 1)
// /* I2C4EN: reserved for STM32L475xx */
// FIELD(APB1ENR2, LPUART1EN, 0, 1)
// REG32(APB2ENR, 0x60)
// FIELD(APB2ENR, DFSDM1EN, 24, 1)
// FIELD(APB2ENR, SAI2EN, 22, 1)
// FIELD(APB2ENR, SAI1EN, 21, 1)
// FIELD(APB2ENR, TIM17EN, 18, 1)
// FIELD(APB2ENR, TIM16EN, 17, 1)
// FIELD(APB2ENR, TIM15EN, 16, 1)
// FIELD(APB2ENR, USART1EN, 14, 1)
// FIELD(APB2ENR, TIM8EN, 13, 1)
// FIELD(APB2ENR, SPI1EN, 12, 1)
// FIELD(APB2ENR, TIM1EN, 11, 1)
// FIELD(APB2ENR, SDMMC1EN, 10, 1)
// FIELD(APB2ENR, FWEN, 7, 1)
// FIELD(APB2ENR, SYSCFGEN, 0, 1)
// REG32(AHB1SMENR, 0x68)
// REG32(AHB2SMENR, 0x6C)
// REG32(AHB3SMENR, 0x70)
// REG32(APB1SMENR1, 0x78)
// REG32(APB1SMENR2, 0x7C)
// REG32(APB2SMENR, 0x80)
// REG32(CCIPR, 0x88)
// FIELD(CCIPR, DFSDM1SEL, 31, 1)
// FIELD(CCIPR, SWPMI1SEL, 30, 1)
// FIELD(CCIPR, ADCSEL, 28, 2)
// FIELD(CCIPR, CLK48SEL, 26, 2)
// FIELD(CCIPR, SAI2SEL, 24, 2)
// FIELD(CCIPR, SAI1SEL, 22, 2)
// FIELD(CCIPR, LPTIM2SEL, 20, 2)
// FIELD(CCIPR, LPTIM1SEL, 18, 2)
// FIELD(CCIPR, I2C3SEL, 16, 2)
// FIELD(CCIPR, I2C2SEL, 14, 2)
// FIELD(CCIPR, I2C1SEL, 12, 2)
// FIELD(CCIPR, LPUART1SEL, 10, 2)
// FIELD(CCIPR, UART5SEL, 8, 2)
// FIELD(CCIPR, UART4SEL, 6, 2)
// FIELD(CCIPR, USART3SEL, 4, 2)
// FIELD(CCIPR, USART2SEL, 2, 2)
// FIELD(CCIPR, USART1SEL, 0, 2)
// REG32(BDCR, 0x90)
// FIELD(BDCR, LSCOSEL, 25, 1)
// FIELD(BDCR, LSCOEN, 24, 1)
// FIELD(BDCR, BDRST, 16, 1)
// FIELD(BDCR, RTCEN, 15, 1)
// FIELD(BDCR, RTCSEL, 8, 2)
// FIELD(BDCR, LSECSSD, 6, 1)
// FIELD(BDCR, LSECSSON, 5, 1)
// FIELD(BDCR, LSEDRV, 3, 2)
// FIELD(BDCR, LSEBYP, 2, 1)
// FIELD(BDCR, LSERDY, 1, 1)
// FIELD(BDCR, LSEON, 0, 1)
// REG32(CSR, 0x94)
// FIELD(CSR, LPWRRSTF, 31, 1)
// FIELD(CSR, WWDGRSTF, 30, 1)
// FIELD(CSR, IWDGRSTF, 29, 1)
// FIELD(CSR, SFTRSTF, 28, 1)
// FIELD(CSR, PORRSTF, 27, 1)
// FIELD(CSR, PINRSTF, 26, 1)
// FIELD(CSR, BORRSTF, 25, 1)
// FIELD(CSR, RMVF, 24, 1)
// FIELD(CSR, LSIRDY, 1, 1)
// FIELD(CSR, LSION, 0, 1)
/* CRRCR and CCIPR2 registers are present on L496/L4A6 devices only. */
REG32(DCKCFGR, 0X8C)
FIELD(DCKCFGR, TIMPRE, 24, 1)
FIELD(DCKCFGR, SAI1BSRC, 22, 2)
FIELD(DCKCFGR, SAI1ASRC, 20, 2)
FIELD(DCKCFGR, PLLSAIDIVR, 16, 2)
FIELD(DCKCFGR, PLLSAIDIVQ, 8, 5)
FIELD(DCKCFGR, PLLS2DIVQ, 0, 5)

/* Read Only masks to prevent writes in unauthorized bits */
#define CR_READ_ONLY_MASK (R_CR_PLLSAIRDY_MASK | \
                           R_CR_PLLI2SRDY_MASK | \
                           R_CR_PLLRDY_MASK |    \
                           R_CR_HSERDY_MASK |    \
                           R_CR_HSICAL_MASK |    \
                           R_CR_HSIRDY_MASK)
#define CR_READ_SET_MASK (R_CR_PLLSAION_MASK | \
                          R_CR_PLLI2SON_MASK | \
                          R_CR_PLLON_MASK |    \
                          R_CR_CSSON_MASK |    \
                          R_CR_HSEBYP_MASK |   \
                          R_CR_HSEON_MASK |    \
                          R_CR_HSITRIM_MASK |  \
                          R_CR_HSION_MASK)
#define CFGR_READ_ONLY_MASK   (R_CFGR_SWS_MASK)
#define APB2ENR_READ_SET_MASK (R_APB2ENR_FWEN_MASK)
#define BDCR_READ_ONLY_MASK   (R_BDCR_LSECSSD_MASK | R_BDCR_LSERDY_MASK)
#define CSR_READ_ONLY_MASK    (R_CSR_LPWRRSTF_MASK | \
                            R_CSR_WWDGRSTF_MASK |    \
                            R_CSR_SFTRSTF_MASK |     \
                            R_CSR_BORRSTF_MASK |     \
                            R_CSR_PINRSTF_MASK |     \
                            R_CSR_LSIRDY_MASK)

/* Pll Channels */
enum PllChannels {
    RCC_PLL_CHANNEL_PLLCLK  = 0,
    RCC_PLL_CHANNEL_PLL48CK = 1,
    /* No R channel */
};

enum PLLI2SChannels {
    /* No P channel */
    RCC_PLLI2S_CHANNEL_PLLSAICLK = 1,
    RCC_PLLI2S_CHANNEL_PLLI2SCLK = 2,
};

enum PLLSAIChannels {
    /* No P channel */
    RCC_PLLSAI_CHANNEL_PLLSAICLK = 1,
    RCC_PLLSAI_CHANNEL_PLLCDCLK  = 2,
};

typedef enum RccClockMuxSource {
    RCC_CLOCK_MUX_SRC_GND = 0,
    RCC_CLOCK_MUX_SRC_HSI,
    RCC_CLOCK_MUX_SRC_LSE,
    RCC_CLOCK_MUX_SRC_HSE,
    RCC_CLOCK_MUX_SRC_PLLCLK,
    RCC_CLOCK_MUX_SRC_LSI,
    RCC_CLOCK_MUX_SRC_PLL48CK,
    RCC_CLOCK_MUX_SRC_PLLSAICLK_I2S,
    RCC_CLOCK_MUX_SRC_PLLI2SCLK,
    RCC_CLOCK_MUX_SRC_PLLSAICLK_SAI,
    RCC_CLOCK_MUX_SRC_PLLCDCLK,
    RCC_CLOCK_MUX_SRC_I2S_CKIN,
    RCC_CLOCK_MUX_SRC_SYSCLK,
    RCC_CLOCK_MUX_SRC_HCLK,
    RCC_CLOCK_MUX_SRC_PCLK1,
    RCC_CLOCK_MUX_SRC_PCLK2,
    RCC_CLOCK_MUX_SRC_HSE_RTC,
    RCC_CLOCK_MUX_SRC_RTCCLK,

